<?php

// +----------------------------------------------------------------------
// | Think.Admin
// +----------------------------------------------------------------------
// | 版权所有 2014~2017 广州楚才信息科技有限公司 [ http://www.cuci.cc ]
// +----------------------------------------------------------------------
// | 官方网站: http://think.ctolog.com
// +----------------------------------------------------------------------
// | 开源协议 ( https://mit-license.org )
// +----------------------------------------------------------------------
// | github开源项目：https://github.com/zoujingli/Think.Admin
// +----------------------------------------------------------------------

/* SESSION会话名称 */
session_name(md5(__FILE__));
/* 定义应用目录 */
define('APP_PATH', dirname(__DIR__) . '/application/');
/* 加载框架引导文件 */
require dirname(__DIR__) . '/thinkphp/start.php';
